#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
[command]/home/runner/work/_temp/aefa8a32-a2fb-403d-a507-b34ae559dafc/terraform-bin plan -input=false -no-color
random_string.random: Refreshing state... [id=ymzi27]
module.in_app_metrics.random_string.bucket_random_id: Refreshing state... [id=gtlmt]
aws_acm_certificate.retrieval_covidshield: Refreshing state... [id=arn:aws:acm:us-east-1:445131834497:certificate/289d5579-f1b4-4060-911c-6e6ab6bc4715]
aws_wafv2_web_acl.key_retrieval_cdn: Refreshing state... [id=290c0829-fa25-4082-8a42-9467b4b29304]
aws_secretsmanager_secret.server_database_url: Refreshing state... [id=arn:aws:secretsmanager:ca-central-1:445131834497:secret:server-database-url-ymzi27-AhOoLD]
aws_secretsmanager_secret.key_retrieval_env_ecdsa_key: Refreshing state... [id=arn:aws:secretsmanager:ca-central-1:445131834497:secret:key-retrieval-env-ecdsa-key-ymzi27-HB1VtN]
aws_ecs_cluster.covidshield: Refreshing state... [id=arn:aws:ecs:ca-central-1:445131834497:cluster/CovidShield]
aws_secretsmanager_secret.key_submission_metrics_password: Refreshing state... [id=arn:aws:secretsmanager:ca-central-1:445131834497:secret:key-metric-password-ymzi27-iaJwHm]
aws_secretsmanager_secret.key_retrieval_env_hmac_key: Refreshing state... [id=arn:aws:secretsmanager:ca-central-1:445131834497:secret:key-retrieval-env-hmac-key-ymzi27-z6S5xz]
aws_secretsmanager_secret.key_submission_env_key_claim_token: Refreshing state... [id=arn:aws:secretsmanager:ca-central-1:445131834497:secret:key-submission-env-key-claim-token-ymzi27-ctDs6X]
aws_wafv2_web_acl.metrics_collection: Refreshing state... [id=388d83ff-347d-4f07-a6e8-dcfaed31f022]
aws_wafv2_ip_set.new_key_claim: Refreshing state... [id=26e4496f-65b1-4a72-b9b0-642e05452cf4]
aws_vpc.covidshield: Refreshing state... [id=vpc-0f08d59ec610efa9f]
aws_route53_health_check.covidshield_key_submission_healthcheck: Refreshing state... [id=3150afd9-a1d6-4787-bbfb-99924327739d]
module.in_app_metrics.aws_cloudwatch_event_rule.twice-a-day: Refreshing state... [id=twice-a-day]
module.in_app_metrics.aws_kms_key.metrics_key: Refreshing state... [id=db9f31f6-6724-4098-ba20-f6ac412e46b3]
aws_route53_health_check.covidshield_key_retrieval_healthcheck_ca_json: Refreshing state... [id=cd6f210a-78ce-4ba6-a90f-47e72a8b4753]
aws_api_gateway_api_key.metrics_api_key: Refreshing state... [id=en5arm2qtg]
aws_wafv2_web_acl.key_retrieval: Refreshing state... [id=6f2f44a7-242d-4626-996b-8919690096b6]
aws_acm_certificate.covidshield: Refreshing state... [id=arn:aws:acm:ca-central-1:445131834497:certificate/afa9146e-c959-477b-bbd3-caafa32bba53]
aws_route53_health_check.covidshield_key_retrieval_healthcheck: Refreshing state... [id=40fadd9c-0b75-4b17-b478-cdf083a1dfe7]
aws_cloudwatch_log_group.metrics: Refreshing state... [id=/aws/lambda/save-metrics]
aws_api_gateway_rest_api.metrics: Refreshing state... [id=v1o7d57660]
aws_iam_role.api_gatway_cloudwatch_role: Refreshing state... [id=save-metricsapi_gateway_cloudwatch_role]
aws_ecr_repository.repository["key-submission"]: Refreshing state... [id=covid-server/key-submission]
aws_iam_role.firehose_waf_logs: Refreshing state... [id=firehose_waf_logs]
aws_ecr_repository.repository["monolith"]: Refreshing state... [id=covid-server/monolith]
aws_ecr_repository.repository["key-retrieval"]: Refreshing state... [id=covid-server/key-retrieval]
aws_cloudfront_origin_access_identity.origin_access_identity: Refreshing state... [id=E212DUJ8FH57AC]
aws_iam_role.lambda_validate_deploy: Refreshing state... [id=lambda-validate-deploy]
aws_route53_zone.covidshield: Refreshing state... [id=Z028665636H79UA5DVHCV]
module.in_app_metrics.aws_dynamodb_table.raw_metrics: Refreshing state... [id=raw_metrics]
aws_route53_health_check.covidshield_key_retrieval_healthcheck_region_json: Refreshing state... [id=bd344266-36ab-4a72-9b40-82855b3bde94]
module.in_app_metrics.aws_ecr_repository.create_csv: Refreshing state... [id=covid-server/metrics-server]
aws_iam_role.vpc_flow_logs: Refreshing state... [id=vpc_flow_logs]
module.in_app_metrics.aws_dynamodb_table.aggregate_metrics: Refreshing state... [id=aggregate_metrics]
aws_iam_role.role: Refreshing state... [id=save-metrics.role]
aws_secretsmanager_secret_version.key_submission_env_key_claim_token: Refreshing state... [id=arn:aws:secretsmanager:ca-central-1:445131834497:secret:key-submission-env-key-claim-token-ymzi27-ctDs6X|ADE432F1-1B59-4B86-A53E-50F4ECC8A206]
aws_secretsmanager_secret_version.key_submission_metrics_password: Refreshing state... [id=arn:aws:secretsmanager:ca-central-1:445131834497:secret:key-metric-password-ymzi27-iaJwHm|A7101EDF-0682-4BE6-8CF2-C656723D19CF]
aws_secretsmanager_secret_version.key_retrieval_env_hmac_key: Refreshing state... [id=arn:aws:secretsmanager:ca-central-1:445131834497:secret:key-retrieval-env-hmac-key-ymzi27-z6S5xz|6D05AB97-E512-4326-8313-38440FD6AA82]
aws_secretsmanager_secret_version.key_retrieval_env_ecdsa_key: Refreshing state... [id=arn:aws:secretsmanager:ca-central-1:445131834497:secret:key-retrieval-env-ecdsa-key-ymzi27-HB1VtN|24676F69-CBA3-43F2-816C-5758B7AD8C55]
module.in_app_metrics.aws_s3_bucket.unmasked_metrics: Refreshing state... [id=unmasked-metrics-gtlmt-demo]
module.in_app_metrics.aws_s3_bucket.masked_metrics: Refreshing state... [id=masked-metrics-gtlmt-demo]
module.in_app_metrics.aws_sqs_queue.aggregation_lambda_dead_letter: Refreshing state... [id=https://sqs.ca-central-1.amazonaws.com/445131834497/aggregation-lambda-dead-letter-queue]
module.in_app_metrics.aws_iam_policy.vpc_networking: Refreshing state... [id=arn:aws:iam::445131834497:policy/CovidAlertVplNetworking]
aws_iam_role.covidshield_key_retrieval: Refreshing state... [id=KeyRetrieval]
aws_s3_bucket.exposure_config: Refreshing state... [id=covid-shield-exposure-config-demo]
aws_api_gateway_account.demo: Refreshing state... [id=api-gateway-account]
aws_iam_role_policy.cloudwatch: Refreshing state... [id=save-metricsapi_gateway_cloudwatch_role:default]
module.in_app_metrics.aws_iam_role.backoff: Refreshing state... [id=backoff_lambda_role]
aws_iam_role.covidshield_key_submission: Refreshing state... [id=KeySubmission]
module.in_app_metrics.aws_iam_policy.write_logs: Refreshing state... [id=arn:aws:iam::445131834497:policy/CovidAlertLogWriter]
module.in_app_metrics.aws_iam_role.metrics_csv: Refreshing state... [id=metrics_csv_lambda_role]
module.in_app_metrics.aws_iam_role.aggregator: Refreshing state... [id=aggregate_lambda_role]
aws_iam_policy.lambda_logging: Refreshing state... [id=arn:aws:iam::445131834497:policy/save-metrics]
aws_kms_key.cw_us_east: Refreshing state... [id=343f7858-fa06-4db4-b222-6519c0fe4735]
aws_s3_bucket.firehose_waf_logs: Refreshing state... [id=covid-shield-demo-waf-logs]
aws_kms_key.cw: Refreshing state... [id=db78cf66-2642-4829-bc44-2dd721e952f0]
aws_s3_bucket.cloudfront_logs: Refreshing state... [id=covid-shield-demo-cloudfront-logs]
aws_wafv2_web_acl.key_submission: Refreshing state... [id=1dbee81d-3f78-4a42-adf0-beec8a1007b8]
aws_api_gateway_request_validator.metrics_model: Refreshing state... [id=pt0x5x]
aws_cloudwatch_log_group.api_log_group: Refreshing state... [id=API-Gateway-Execution-Logs_v1o7d57660/demo]
aws_api_gateway_deployment.metrics: Refreshing state... [id=edgg45]
aws_api_gateway_model.metrics_model: Refreshing state... [id=vai176]
aws_api_gateway_resource.create_resource: Refreshing state... [id=ut4qtu]
aws_iam_role.codedeploy: Refreshing state... [id=codedeploy]
aws_route53_record.retrieval_covidshield_certificate_validation["retrieval.covid-alert-demo.cdssandbox.xyz"]: Refreshing state... [id=Z028665636H79UA5DVHCV__76fc87244e04f8cb562681bf007d9884.retrieval.covid-alert-demo.cdssandbox.xyz_CNAME]
aws_api_gateway_domain_name.metrics: Refreshing state... [id=metrics.covid-alert-demo.cdssandbox.xyz]
aws_route53_record.covidshield_certificate_validation["covid-alert-demo.cdssandbox.xyz"]: Refreshing state... [id=Z028665636H79UA5DVHCV__1c28ba959650d936e6eeea7da23f069f.covid-alert-demo.cdssandbox.xyz._CNAME]
aws_route53_record.covidshield_certificate_validation["*.covid-alert-demo.cdssandbox.xyz"]: Refreshing state... [id=Z028665636H79UA5DVHCV__1c28ba959650d936e6eeea7da23f069f.covid-alert-demo.cdssandbox.xyz._CNAME]
aws_ecr_lifecycle_policy.policy["monolith"]: Refreshing state... [id=covid-server/monolith]
aws_ecr_lifecycle_policy.policy["key-retrieval"]: Refreshing state... [id=covid-server/key-retrieval]
aws_ecr_lifecycle_policy.policy["key-submission"]: Refreshing state... [id=covid-server/key-submission]
aws_iam_role_policy.lambda_validate_codedeploy: Refreshing state... [id=lambda-validate-deploy:LambdaValidateCodeDeploy]
aws_iam_role_policy_attachment.lambda_validate_deploy: Refreshing state... [id=lambda-validate-deploy-2020090819343193090000000c]
aws_iam_policy.covidshield_secrets_manager_key_submission: Refreshing state... [id=arn:aws:iam::445131834497:policy/CovidShieldSecretsManagerKeySubmission]
aws_iam_policy.covidshield_secrets_manager_key_retrieval: Refreshing state... [id=arn:aws:iam::445131834497:policy/CovidShieldSecretsManagerKeyRetrieval]
aws_iam_role_policy.vpc_flow_logs: Refreshing state... [id=vpc_flow_logs:vpc_flow_logs]
aws_iam_role_policy_attachment.ecs_task_execution_key_retrieval: Refreshing state... [id=KeyRetrieval-2020090819343243930000000e]
aws_subnet.covidshield_public[2]: Refreshing state... [id=subnet-052e969015b02237a]
aws_subnet.covidshield_public[0]: Refreshing state... [id=subnet-0fbf4adf70e11a429]
aws_subnet.covidshield_public[1]: Refreshing state... [id=subnet-0a1698d1655c0e817]
aws_vpc_endpoint.s3: Refreshing state... [id=vpce-0832f6b777296d775]
aws_lb_target_group.covidshield_key_submission: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:445131834497:targetgroup/covidshield-key-submission/4634b35f4b1e2347]
aws_lb_target_group.covidshield_key_submission_2: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:445131834497:targetgroup/covidshield-key-submission-2/b67484245795c166]
aws_internet_gateway.covidshield: Refreshing state... [id=igw-0f3e1bdc281e9d2bf]
aws_security_group.covidshield_key_retrieval: Refreshing state... [id=sg-050c0ea08bb934a58]
aws_default_network_acl.covidshield: Refreshing state... [id=acl-0931e35bd44f24857]
aws_security_group.covidshield_key_submission: Refreshing state... [id=sg-0144054019c7390e2]
aws_default_security_group.default: Refreshing state... [id=sg-02a4d2c4c07667948]
aws_security_group.privatelink: Refreshing state... [id=sg-048b03993c8765ef5]
aws_lb_target_group.covidshield_key_retrieval_2: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:445131834497:targetgroup/covidshield-key-retrieval-2/46f359cb6c1e8aae]
aws_subnet.covidshield_private[2]: Refreshing state... [id=subnet-08241ad4f1968ece8]
aws_lb_target_group.covidshield_key_retrieval: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:445131834497:targetgroup/covidshield-key-retrieval/7ed459bf5f80df88]
aws_subnet.covidshield_private[0]: Refreshing state... [id=subnet-004f7bd4f9af4d6d4]
aws_subnet.covidshield_private[1]: Refreshing state... [id=subnet-0e62dcdf9b0516543]
module.in_app_metrics.aws_iam_role_policy_attachment.backoff_log_writer: Refreshing state... [id=backoff_lambda_role-20210428195652938700000003]
module.in_app_metrics.aws_iam_role_policy_attachment.metrics_csv_vpc_networking: Refreshing state... [id=metrics_csv_lambda_role-20210428195653231700000004]
module.in_app_metrics.aws_iam_role_policy_attachment.metrics_csv_log_writer: Refreshing state... [id=metrics_csv_lambda_role-20210428195653247700000005]
module.in_app_metrics.aws_iam_role_policy_attachment.aggregator_log_writer: Refreshing state... [id=aggregate_lambda_role-20210428195652634500000002]
module.in_app_metrics.aws_iam_role_policy_attachment.aggregator_vpc_networking: Refreshing state... [id=aggregate_lambda_role-20210428195653537500000006]
aws_iam_role_policy_attachment.lambda_logs: Refreshing state... [id=save-metrics.role-20210428195649708100000001]
aws_iam_role_policy_attachment.ecs_task_execution_key_submission: Refreshing state... [id=KeySubmission-2020090819343237630000000d]
module.in_app_metrics.aws_iam_role_policy_attachment.backoff_vpc_networking: Refreshing state... [id=backoff_lambda_role-20210428195653567000000007]
aws_sns_topic.alert_warning_us_east: Refreshing state... [id=arn:aws:sns:us-east-1:445131834497:alert-warning]
aws_iam_role_policy_attachment.codedeploy: Refreshing state... [id=codedeploy-2020090819343151530000000b]
aws_api_gateway_stage.metrics: Refreshing state... [id=ags-v1o7d57660-demo]
aws_api_gateway_method.create_method: Refreshing state... [id=agm-v1o7d57660-ut4qtu-POST]
aws_sns_topic.alert_critical_us_east: Refreshing state... [id=arn:aws:sns:us-east-1:445131834497:alert-critical]
aws_cloudwatch_log_group.vpc_flow_logs: Refreshing state... [id=vpc_flow_logs]
aws_cloudwatch_log_group.covidshield: Refreshing state... [id=CovidShield]
aws_sns_topic.alert_critical: Refreshing state... [id=arn:aws:sns:ca-central-1:445131834497:alert-critical]
aws_sns_topic.alert_warning: Refreshing state... [id=arn:aws:sns:ca-central-1:445131834497:alert-warning]
module.in_app_metrics.aws_vpc_endpoint.dynamodb: Refreshing state... [id=vpce-06074834809a1233f]
aws_route53_record.covidshield_metrics_submission: Refreshing state... [id=Z028665636H79UA5DVHCV_metrics.covid-alert-demo.cdssandbox.xyz_A]
module.in_app_metrics.aws_iam_policy.pull_create_csv_image_policy: Refreshing state... [id=arn:aws:iam::445131834497:policy/PullCreateCSVImage]
aws_iam_role_policy_attachment.secrets_manager_key_submission: Refreshing state... [id=KeySubmission-20200908193433359000000010]
aws_acm_certificate_validation.retrieval_covidshield: Refreshing state... [id=2020-09-09 18:39:23 +0000 UTC]
aws_acm_certificate_validation.covidshield: Refreshing state... [id=2020-09-09 18:38:31 +0000 UTC]
aws_iam_role_policy_attachment.secrets_manager_key_retrieval: Refreshing state... [id=KeyRetrieval-2020090819343333820000000f]
aws_route_table.covidshield_public_subnet: Refreshing state... [id=rtb-0b9cc4dfb2dc7da35]
aws_s3_bucket_policy.exposure_config: Refreshing state... [id=covid-shield-exposure-config-demo]
aws_security_group_rule.covidshield_key_retrieval_egress_s3_privatelink: Refreshing state... [id=sgrule-1252579530]
aws_security_group.covidshield_database: Refreshing state... [id=sg-0e7193f9a26463806]
aws_security_group_rule.covidshield_key_submission_egress_s3_privatelink: Refreshing state... [id=sgrule-405718043]
aws_security_group_rule.covidshield_key_submission_egress_privatelink: Refreshing state... [id=sgrule-3211372061]
aws_security_group_rule.privatelink_retrieval_ingress: Refreshing state... [id=sgrule-259250637]
aws_security_group_rule.privatelink_submission_ingress: Refreshing state... [id=sgrule-920808560]
aws_security_group_rule.covidshield_key_retrieval_egress_privatelink: Refreshing state... [id=sgrule-1682999244]
aws_kinesis_firehose_delivery_stream.firehose_waf_logs: Refreshing state... [id=arn:aws:firehose:ca-central-1:445131834497:deliverystream/aws-waf-logs-covid-shield]
aws_s3_bucket_public_access_block.cloudfront_logs: Refreshing state... [id=covid-shield-demo-cloudfront-logs]
aws_iam_role_policy.firehose_waf_logs: Refreshing state... [id=firehose_waf_logs:firehose-waf-logs-policy]
aws_s3_bucket_public_access_block.firehose_waf_logs: Refreshing state... [id=covid-shield-demo-waf-logs]
aws_kinesis_firehose_delivery_stream.firehose_waf_logs_us_east: Refreshing state... [id=arn:aws:firehose:us-east-1:445131834497:deliverystream/aws-waf-logs-covid-shield-us-east]
module.in_app_metrics.aws_iam_policy.aggregate_metrics_stream_processor: Refreshing state... [id=arn:aws:iam::445131834497:policy/CovidAlertAggregateMetricsStreamProcessor]
module.in_app_metrics.aws_iam_policy.aggregate_metrics_update: Refreshing state... [id=arn:aws:iam::445131834497:policy/CovidAlertAggregateMetricsUpdateItem]
module.in_app_metrics.aws_iam_policy.raw_metrics_put: Refreshing state... [id=arn:aws:iam::445131834497:policy/CovidAlertRawMetricsPutItem]
module.in_app_metrics.aws_iam_policy.raw_metrics_stream_processor: Refreshing state... [id=arn:aws:iam::445131834497:policy/CovidAlertRawMetricsStreamProcessor]
module.in_app_metrics.aws_iam_policy.write_and_encrypt_deadletter_queue: Refreshing state... [id=arn:aws:iam::445131834497:policy/CovidAlertWriteAndEncryptDeadletterQueue]
module.in_app_metrics.aws_iam_policy.read_write_and_encrypt_deadletter_queue: Refreshing state... [id=arn:aws:iam::445131834497:policy/CovidAlertReadWriteAndEncryptDeadletterQueue]
aws_vpc_endpoint.sqs: Refreshing state... [id=vpce-0d1adcf2d5bf5e3c8]
aws_vpc_endpoint.kms: Refreshing state... [id=vpce-044381c570ffd923b]
aws_vpc_endpoint.monitoring: Refreshing state... [id=vpce-0f7ef51ba75bad3cc]
aws_db_subnet_group.covidshield: Refreshing state... [id=server]
aws_vpc_endpoint.logs: Refreshing state... [id=vpce-07e0933bf18287537]
aws_vpc_endpoint.secretsmanager: Refreshing state... [id=vpce-0143beebfa374c848]
aws_security_group.covidshield_load_balancer: Refreshing state... [id=sg-0aa63ed37c38d415f]
aws_cloudwatch_metric_alarm.route53_submission_health_check: Refreshing state... [id=Route53SubmissionHealthCheck]
aws_cloudwatch_metric_alarm.route53_retrieval_health_check_region_json: Refreshing state... [id=Route53RetrievalHealthCheckRegionJson]
aws_cloudwatch_metric_alarm.route53_retrieval_health_check: Refreshing state... [id=Route53RetrievalHealthCheck]
aws_cloudwatch_metric_alarm.route53_retrieval_health_check_ca_json: Refreshing state... [id=Route53RetrievalHealthCheckCAJson]
aws_cloudwatch_metric_alarm.ddos_detected_route53: Refreshing state... [id=DDoSDetectedRoute53]
module.in_app_metrics.aws_security_group.metrics_csv_sg: Refreshing state... [id=sg-0ea6776ab3b8c34c2]
aws_api_gateway_base_path_mapping.metrics: Refreshing state... [id=metrics.covid-alert-demo.cdssandbox.xyz/]
aws_api_gateway_method_response.response_500: Refreshing state... [id=agmr-v1o7d57660-ut4qtu-POST-500]
aws_api_gateway_method_response.response_200: Refreshing state... [id=agmr-v1o7d57660-ut4qtu-POST-200]
aws_wafv2_web_acl_association.waf_association: Refreshing state... [id=arn:aws:wafv2:ca-central-1:445131834497:regional/webacl/metrics_collection1/388d83ff-347d-4f07-a6e8-dcfaed31f022,arn:aws:apigateway:ca-central-1::/restapis/v1o7d57660/stages/demo]
aws_api_gateway_method_settings.method_settings: Refreshing state... [id=v1o7d57660-demo-save-metrics/POST]
aws_flow_log.vpc_flow_logs: Refreshing state... [id=fl-0f8658a462c4f2c86]
aws_cloudwatch_log_metric_filter.five_hundred_response: Refreshing state... [id=500Response]
aws_cloudwatch_log_metric_filter.unauthorized_new_one_time_code_requests: Refreshing state... [id=UnauthorizedNewOneTimeCodeRequests]
aws_cloudwatch_log_metric_filter.UnclaimedOneTimeCodeTotal[2]: Refreshing state... [id=UnclaimedOneTimeCodeTotal2]
aws_cloudwatch_log_metric_filter.unauthorized_one_time_code_claim_requests: Refreshing state... [id=UnauthorizedOneTimeCodeClaimRequests]
aws_cloudwatch_log_metric_filter.UnclaimedOneTimeCodeTotal[1]: Refreshing state... [id=UnclaimedOneTimeCodeTotal1]
aws_cloudwatch_log_metric_filter.unauthorized_upload_requests: Refreshing state... [id=UnauthorizedUploadRequests]
aws_cloudwatch_log_metric_filter.ClaimedOneTimeCodeTotal[7]: Refreshing state... [id=ClaimedOneTimeCodeTotal7]
aws_cloudwatch_log_metric_filter.UnclaimedOneTimeCodeTotal[5]: Refreshing state... [id=UnclaimedOneTimeCodeTotal5]
aws_cloudwatch_log_metric_filter.UnclaimedOneTimeCodeTotal[7]: Refreshing state... [id=UnclaimedOneTimeCodeTotal7]
aws_cloudwatch_log_metric_filter.UnclaimedOneTimeCodeTotal[3]: Refreshing state... [id=UnclaimedOneTimeCodeTotal3]
aws_cloudwatch_log_metric_filter.UnclaimedOneTimeCodeTotal[4]: Refreshing state... [id=UnclaimedOneTimeCodeTotal4]
aws_cloudwatch_log_metric_filter.UnclaimedOneTimeCodeTotal[6]: Refreshing state... [id=UnclaimedOneTimeCodeTotal6]
aws_cloudwatch_log_metric_filter.UnclaimedOneTimeCodeTotal[0]: Refreshing state... [id=UnclaimedOneTimeCodeTotal0]
aws_cloudwatch_log_metric_filter.error_logged: Refreshing state... [id=ErrorLogged]
aws_cloudwatch_log_metric_filter.key_clear_called: Refreshing state... [id=KeyClearCalled]
aws_cloudwatch_log_metric_filter.ClaimedOneTimeCodeTotal[0]: Refreshing state... [id=ClaimedOneTimeCodeTotal0]
aws_cloudwatch_log_metric_filter.ClaimedOneTimeCodeTotal[5]: Refreshing state... [id=ClaimedOneTimeCodeTotal5]
aws_cloudwatch_log_metric_filter.ClaimedOneTimeCodeTotal[1]: Refreshing state... [id=ClaimedOneTimeCodeTotal1]
aws_cloudwatch_log_metric_filter.ClaimedOneTimeCodeTotal[2]: Refreshing state... [id=ClaimedOneTimeCodeTotal2]
aws_cloudwatch_log_metric_filter.ClaimedOneTimeCodeTotal[3]: Refreshing state... [id=ClaimedOneTimeCodeTotal3]
aws_cloudwatch_log_metric_filter.ClaimedOneTimeCodeTotal[4]: Refreshing state... [id=ClaimedOneTimeCodeTotal4]
aws_cloudwatch_log_metric_filter.ClaimedOneTimeCodeTotal[6]: Refreshing state... [id=ClaimedOneTimeCodeTotal6]
aws_cloudwatch_log_metric_filter.fatal_logged: Refreshing state... [id=FatalLogged]
aws_cloudwatch_log_metric_filter.DiagnosisKeyTotal[0]: Refreshing state... [id=DiagnosisKeyTotal0]
module.in_app_metrics.aws_iam_policy.write_s3_metrics_csv_buckets: Refreshing state... [id=arn:aws:iam::445131834497:policy/CovidAlertWriteS3CSVBuckets]
aws_cloudwatch_log_metric_filter.DiagnosisKeyTotal[1]: Refreshing state... [id=DiagnosisKeyTotal1]
aws_cloudwatch_log_metric_filter.DiagnosisKeyTotal[3]: Refreshing state... [id=DiagnosisKeyTotal3]
module.in_app_metrics.aws_iam_role_policy_attachment.metrics_csv_pull_create_csv_image: Refreshing state... [id=metrics_csv_lambda_role-20210428195653857600000008]
aws_cloudwatch_metric_alarm.metrics_api_gateway_errors_above_threshold: Refreshing state... [id=metrics-api-gateway-errors-above-threshold]
aws_cloudwatch_log_metric_filter.DiagnosisKeyTotal[2]: Refreshing state... [id=DiagnosisKeyTotal2]
aws_cloudwatch_log_metric_filter.DiagnosisKeyTotal[4]: Refreshing state... [id=DiagnosisKeyTotal4]
aws_cloudwatch_log_metric_filter.DiagnosisKeyTotal[5]: Refreshing state... [id=DiagnosisKeyTotal5]
aws_cloudwatch_log_metric_filter.DiagnosisKeyTotal[7]: Refreshing state... [id=DiagnosisKeyTotal7]
aws_cloudwatch_log_metric_filter.DiagnosisKeyTotal[6]: Refreshing state... [id=DiagnosisKeyTotal6]
aws_cloudwatch_metric_alarm.DiagnosisKeyTotalCritical: Refreshing state... [id=DiagnosisKeyTotalCritical]
aws_cloudwatch_metric_alarm.metrics_api_gateway_min_invocations_threshold: Refreshing state... [id=metrics-api-gateway-below-minimum-invocations]
aws_cloudwatch_metric_alarm.UnclaimedOneTimeCodeTotalCritical: Refreshing state... [id=UnclaimedOneTimeCodeTotalCritical]
aws_cloudwatch_metric_alarm.ClaimedOneTimeCodeTotalCritical: Refreshing state... [id=ClaimedOneTimeCodeTotalCritical]
aws_cloudwatch_metric_alarm.metrics_api_gateway_max_latency_threshold: Refreshing state... [id=metrics-api-gateway-above-maximum-latency]
aws_cloudwatch_metric_alarm.ClaimedOneTimeCodeTotalWarn: Refreshing state... [id=ClaimedOneTimeCodeTotalWarn]
aws_cloudwatch_metric_alarm.UnclaimedOneTimeCodeTotalWarn: Refreshing state... [id=UnclaimedOneTimeCodeTotalWarn]
aws_cloudwatch_metric_alarm.DiagnosisKeyTotalWarn: Refreshing state... [id=DiagnosisKeyTotalWarn]
aws_route_table_association.covidshield[2]: Refreshing state... [id=rtbassoc-0171a4c5edf535a1a]
module.in_app_metrics.aws_security_group.aggregate_metrics_sg: Refreshing state... [id=sg-03502e984071cf6e9]
aws_route_table_association.covidshield[0]: Refreshing state... [id=rtbassoc-0ccdcf7ec823db2c9]
aws_route_table_association.covidshield[1]: Refreshing state... [id=rtbassoc-077c53396bbde76f9]
aws_security_group_rule.covidshield_key_submission_egress_database: Refreshing state... [id=sgrule-1944979270]
module.in_app_metrics.aws_security_group.backoff_retry_sg: Refreshing state... [id=sg-0b94e1f42fa286fc2]
aws_security_group_rule.covidshield_key_retrieval_egress_database: Refreshing state... [id=sgrule-2812557439]
module.in_app_metrics.aws_iam_role_policy_attachment.metrics_csv_aggregate_streams: Refreshing state... [id=metrics_csv_lambda_role-20210428195704163500000010]
aws_wafv2_web_acl_logging_configuration.firehose_waf_logs_retrieval_cdn: Refreshing state... [id=arn:aws:wafv2:us-east-1:445131834497:global/webacl/key_retrieval_cdn/290c0829-fa25-4082-8a42-9467b4b29304]
module.in_app_metrics.aws_iam_role_policy_attachment.raw_metrics_put: Refreshing state... [id=save-metrics.role-2021042819565514280000000b]
module.in_app_metrics.aws_iam_role_policy_attachment.backoff_update: Refreshing state... [id=backoff_lambda_role-2021042819570412710000000e]
module.in_app_metrics.aws_iam_role_policy_attachment.aggregator_update: Refreshing state... [id=aggregate_lambda_role-2021042819570414590000000f]
module.in_app_metrics.aws_iam_role_policy_attachment.aggregator_raw_metrics_stream_processor: Refreshing state... [id=aggregate_lambda_role-2021042819565534930000000c]
module.in_app_metrics.aws_iam_role_policy_attachment.backoff_raw_metrics_stream_processor: Refreshing state... [id=backoff_lambda_role-2021042819565547770000000d]
module.in_app_metrics.aws_iam_role_policy_attachment.aggregator_write_and_encrypt_deadletter_queue: Refreshing state... [id=aggregate_lambda_role-2021042819565504150000000a]
module.in_app_metrics.aws_iam_role_policy_attachment.backoff_read_write_and_encrypt_deadletter_queue: Refreshing state... [id=backoff_lambda_role-20210428195654833900000009]
aws_wafv2_web_acl_logging_configuration.firehose_waf_logs_retrieval: Refreshing state... [id=arn:aws:wafv2:ca-central-1:445131834497:regional/webacl/key_retrieval/6f2f44a7-242d-4626-996b-8919690096b6]
aws_vpc_endpoint.ecr-dkr: Refreshing state... [id=vpce-0cb00a5eb43f5007d]
aws_vpc_endpoint.ecr-api: Refreshing state... [id=vpce-094811ce4c6c6306e]
aws_security_group_rule.covidshield_key_submission_ingress_alb: Refreshing state... [id=sgrule-1648376102]
aws_lb.covidshield_key_retrieval: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:445131834497:loadbalancer/app/covidshield-key-retrieval/b1940e8300e9e9a7]
aws_security_group_rule.covidshield_key_retrieval_ingress_alb: Refreshing state... [id=sgrule-1089912613]
aws_lb.covidshield_key_submission: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:445131834497:loadbalancer/app/covidshield-key-submission/bf583bf6161a0916]
aws_rds_cluster.covidshield_server: Refreshing state... [id=server-cluster]
aws_security_group.lambda_sg: Refreshing state... [id=sg-0f7a69822229867ec]
module.in_app_metrics.aws_security_group_rule.privatelink_metrics_csv: Refreshing state... [id=sgrule-1192285241]
aws_cloudwatch_metric_alarm.unauthorized_new_one_time_code_requests_critical: Refreshing state... [id=UnauthorizedNewOneTimeCodeRequestsCritical]
aws_cloudwatch_metric_alarm.unauthorized_new_one_time_code_requests_warn: Refreshing state... [id=UnauthorizedNewOneTimeCodeRequestsWarn]
aws_cloudwatch_metric_alarm.five_hundred_response_critical: Refreshing state... [id=500ResponseCritical]
aws_cloudwatch_metric_alarm.five_hundred_response_warn: Refreshing state... [id=500ResponseWarn]
aws_cloudwatch_metric_alarm.unauthorized_one_time_code_claim_requests_critical: Refreshing state... [id=UnauthorizedOneTimeCodeClaimRequestsCritical]
aws_cloudwatch_metric_alarm.unauthorized_one_time_code_claim_requests_warn: Refreshing state... [id=UnauthorizedOneTimeCodeClaimRequestsWarn]
aws_cloudwatch_metric_alarm.unauthorized_upload_requests_critical: Refreshing state... [id=UnauthorizedUploadRequestsCritical]
aws_cloudwatch_metric_alarm.unauthorized_upload_requests_warn: Refreshing state... [id=UnauthorizedUploadRequestsWarn]
aws_cloudwatch_metric_alarm.error_logged_critical: Refreshing state... [id=ErrorLoggedCritical]
aws_cloudwatch_metric_alarm.error_logged_warn: Refreshing state... [id=ErrorLoggedWarn]
aws_cloudwatch_metric_alarm.key_clear_called_warn: Refreshing state... [id=KeyClearCalledWarn]
aws_cloudwatch_metric_alarm.fatal_logged_warn: Refreshing state... [id=FatalLoggedWarn]
module.in_app_metrics.aws_iam_role_policy_attachment.metrics_csv_s3_write: Refreshing state... [id=metrics_csv_lambda_role-20210428201525644700000001]
aws_wafv2_web_acl_logging_configuration.firehose_waf_logs: Refreshing state... [id=arn:aws:wafv2:ca-central-1:445131834497:regional/webacl/key_submission/1dbee81d-3f78-4a42-adf0-beec8a1007b8]
module.in_app_metrics.aws_security_group_rule.privatelink_metrics_aggregator: Refreshing state... [id=sgrule-2542222106]
module.in_app_metrics.aws_lambda_function.aggregate_metrics: Refreshing state... [id=aggregate_metrics]
module.in_app_metrics.aws_security_group_rule.privatelink_metrics_backoff_ingress: Refreshing state... [id=sgrule-1108626465]
module.in_app_metrics.aws_lambda_function.backoff_retry: Refreshing state... [id=backoff_retry]
aws_lb_listener.covidshield_key_retrieval: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:445131834497:listener/app/covidshield-key-retrieval/b1940e8300e9e9a7/db48f982339bf76d]
aws_lambda_function.retrieval_lambda_validate_deploy: Refreshing state... [id=RetrievalValidateBeforeTraffic]
aws_lb_listener.covidshield_key_retrieval_test: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:445131834497:listener/app/covidshield-key-retrieval/b1940e8300e9e9a7/cbaab6b64effb70b]
aws_lambda_function.metrics: Refreshing state... [id=save-metrics]
aws_cloudwatch_metric_alarm.ddos_detected_retrieval: Refreshing state... [id=DDoSDetectedRetrievalALB]
aws_cloudfront_distribution.key_retrieval_distribution: Refreshing state... [id=E1QB6WEV1C30QU]
aws_wafv2_web_acl_association.key_retrieval_assocation: Refreshing state... [id=arn:aws:wafv2:ca-central-1:445131834497:regional/webacl/key_retrieval/6f2f44a7-242d-4626-996b-8919690096b6,arn:aws:elasticloadbalancing:ca-central-1:445131834497:loadbalancer/app/covidshield-key-retrieval/b1940e8300e9e9a7]
aws_lambda_function.submission_lambda_validate_deploy: Refreshing state... [id=SubmissionValidateBeforeTraffic]
aws_lb_listener.covidshield_key_submission: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:445131834497:listener/app/covidshield-key-submission/bf583bf6161a0916/f3966ae18bf34c50]
aws_route53_record.covidshield_key_submission: Refreshing state... [id=Z028665636H79UA5DVHCV_submission.covid-alert-demo.cdssandbox.xyz._A]
aws_wafv2_web_acl_association.key_submission_assocation: Refreshing state... [id=arn:aws:wafv2:ca-central-1:445131834497:regional/webacl/key_submission/1dbee81d-3f78-4a42-adf0-beec8a1007b8,arn:aws:elasticloadbalancing:ca-central-1:445131834497:loadbalancer/app/covidshield-key-submission/bf583bf6161a0916]
aws_lb_listener.covidshield_key_submission_test: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:445131834497:listener/app/covidshield-key-submission/bf583bf6161a0916/1061c8f1dc1d2645]
aws_cloudwatch_metric_alarm.ddos_detected_submission: Refreshing state... [id=DDoSDetectedSubmissionALB]
aws_secretsmanager_secret_version.server_database_url: Refreshing state... [id=arn:aws:secretsmanager:ca-central-1:445131834497:secret:server-database-url-ymzi27-AhOoLD|46183918-41EE-45FB-950C-C01B6CF1E426]
aws_rds_cluster_instance.covidshield_server_instances[1]: Refreshing state... [id=server-instance-1]
aws_rds_cluster_instance.covidshield_server_instances[2]: Refreshing state... [id=server-instance-2]
aws_rds_cluster_instance.covidshield_server_instances[0]: Refreshing state... [id=server-instance-0]
aws_route53_record.covidshield_key_retrieval: Refreshing state... [id=Z028665636H79UA5DVHCV_retrieval.covid-alert-demo.cdssandbox.xyz._A]
aws_cloudwatch_metric_alarm.ddos_detected_cdn: Refreshing state... [id=DDoSDetectedCDN]
module.in_app_metrics.aws_cloudwatch_log_group.backoff_log_group: Refreshing state... [id=/aws/lambda/backoff_retry]
module.in_app_metrics.aws_cloudwatch_metric_alarm.backoff_retry_average_duration: Refreshing state... [id=save-metrics-average-duration]
module.in_app_metrics.aws_lambda_event_source_mapping.dead_letters: Refreshing state... [id=6c9df394-45a2-468a-b992-ec27a6fbf773]
module.in_app_metrics.aws_lambda_event_source_mapping.raw_metric_stream: Refreshing state... [id=396c367f-a133-46b0-9beb-496fc04e381b]
module.in_app_metrics.aws_cloudwatch_dashboard.metrics_ops_dashboard: Refreshing state... [id=MetricsOps]
module.in_app_metrics.aws_cloudwatch_metric_alarm.aggregate_metrics_average_duration: Refreshing state... [id=aggregate-metrics-average-duration]
module.in_app_metrics.aws_cloudwatch_log_group.metrics: Refreshing state... [id=/aws/lambda/aggregate_metrics]
aws_cloudwatch_metric_alarm.save_metrics_average_duration: Refreshing state... [id=save-metrics-average-duration]
aws_lambda_permission.apigw: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_api_gateway_integration.metrics: Refreshing state... [id=agi-v1o7d57660-ut4qtu-POST]
aws_ecs_task_definition.covidshield_key_submission: Refreshing state... [id=KeySubmission]
aws_ecs_task_definition.covidshield_key_retrieval: Refreshing state... [id=KeyRetrieval]
aws_ecs_service.covidshield_key_submission: Refreshing state... [id=arn:aws:ecs:ca-central-1:445131834497:service/CovidShield/KeySubmission]
aws_ecs_service.covidshield_key_retrieval: Refreshing state... [id=arn:aws:ecs:ca-central-1:445131834497:service/CovidShield/KeyRetrieval]
aws_cloudwatch_metric_alarm.submission_cpu_utilization_high: Refreshing state... [id=submission-cpu-utilization-high]
module.covid-shield-submission.aws_codedeploy_app.app: Refreshing state... [id=ac9fb5d4-4dbe-411a-bbea-bca2c65b3d33:AppECS-CovidShield-KeySubmission]
aws_cloudwatch_metric_alarm.submission_memory_utilization_high: Refreshing state... [id=submission-memory-utilization-high]
aws_cloudwatch_metric_alarm.retrieval_memory_utilization_high: Refreshing state... [id=retrieval-memory-utilization-high]
module.covid-shield-retrieval.aws_codedeploy_app.app: Refreshing state... [id=3b87c6fb-1ab9-41ad-9aff-d05fcd9db4fb:AppECS-CovidShield-KeyRetrieval]
aws_cloudwatch_metric_alarm.retrieval_cpu_utilization_high: Refreshing state... [id=retrieval-cpu-utilization-high]
module.covid-shield-retrieval.aws_codedeploy_deployment_group.app: Refreshing state... [id=5086b4e9-139d-4018-822f-8a194741143c]
module.covid-shield-submission.aws_codedeploy_deployment_group.app: Refreshing state... [id=5620ad47-fc46-41e2-ade1-8c6eafdc618d]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.template_file.covidshield_key_retrieval_task will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "covidshield_key_retrieval_task"  {
      ~ id       = "c89cd3279ce0fb909d8543a5f017af0cc87794bb87f9e9094821d6c5b4bd90f1" -> (known after apply)
      ~ rendered = jsonencode(
            [
              - {
                  - environment      = [
                      - {
                          - name  = "METRIC_PROVIDER"
                          - value = "stdout"
                        },
                      - {
                          - name  = "TRACER_PROVIDER"
                          - value = "stdout"
                        },
                      - {
                          - name  = "ENV"
                          - value = "demo"
                        },
                      - {
                          - name  = "METRICS_USERNAME"
                          - value = "rX8MZ24f1qYiaUXmNVgF"
                        },
                    ]
                  - image            = "445131834497.dkr.ecr.ca-central-1.amazonaws.com/covid-server/key-retrieval"
                  - linuxParameters  = {
                      - capabilities = {
                          - drop = [
                              - "ALL",
                            ]
                        }
                    }
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "CovidShield"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "ecs-KeyRetrieval"
                        }
                    }
                  - name             = "key-retrieval"
                  - portMappings     = [
                      - {
                          - containerPort = 8001
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "KEY_CLAIM_TOKEN"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:445131834497:secret:key-submission-env-key-claim-token-ymzi27-ctDs6X"
                        },
                      - {
                          - name      = "RETRIEVE_HMAC_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:445131834497:secret:key-retrieval-env-hmac-key-ymzi27-z6S5xz"
                        },
                      - {
                          - name      = "ECDSA_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:445131834497:secret:key-retrieval-env-ecdsa-key-ymzi27-HB1VtN"
                        },
                      - {
                          - name      = "DATABASE_URL"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:445131834497:secret:server-database-url-ymzi27-AhOoLD"
                        },
                      - {
                          - name      = "METRICS_PASSWORD"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:445131834497:secret:key-metric-password-ymzi27-iaJwHm"
                        },
                    ]
                },
            ]
        ) -> (known after apply)
      ~ vars     = {
          ~ "ecdsa_key"             = "arn:aws:secretsmanager:ca-central-1:445131834497:secret:key-retrieval-env-ecdsa-key-ymzi27-HB1VtN" -> (known after apply)
            # (12 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)
    }

  # aws_api_gateway_deployment.metrics must be replaced
+/- resource "aws_api_gateway_deployment" "metrics" {
      ~ created_date  = "2021-04-28T20:15:23Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:ca-central-1:445131834497:v1o7d57660/" -> (known after apply)
      ~ id            = "edgg45" -> (known after apply)
      ~ invoke_url    = "https://v1o7d57660.execute-api.ca-central-1.amazonaws.com/" -> (known after apply)
      ~ triggers      = {
          - "redeployment" = "2021-04-28T20:15:22Z"
        } -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_api_gateway_stage.metrics will be updated in-place
  ~ resource "aws_api_gateway_stage" "metrics" {
      ~ deployment_id         = "edgg45" -> (known after apply)
        id                    = "ags-v1o7d57660-demo"
        tags                  = {}
        # (8 unchanged attributes hidden)
    }

  # aws_api_gateway_usage_plan.metrics_usage_plan will be created
  + resource "aws_api_gateway_usage_plan" "metrics_usage_plan" {
      + arn  = (known after apply)
      + id   = (known after apply)
      + name = "in-app-metrics-key_usage_plan"

      + api_stages {
          + api_id = "v1o7d57660"
          + stage  = "demo"
        }
    }

  # aws_api_gateway_usage_plan_key.main will be created
  + resource "aws_api_gateway_usage_plan_key" "main" {
      + id            = (known after apply)
      + key_id        = "en5arm2qtg"
      + key_type      = "API_KEY"
      + name          = (known after apply)
      + usage_plan_id = (known after apply)
      + value         = (known after apply)
    }

  # aws_cloudwatch_metric_alarm.save_metrics_average_duration will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "save_metrics_average_duration" {
      ~ alarm_description         = "This metric monitors average duration for the backoff_retry lambda" -> "This metric monitors average duration for the save_metrics lambda"
      ~ dimensions                = {
          ~ "FunctionName" = "backoff_retry" -> "save-metrics"
        }
        id                        = "save-metrics-average-duration"
        tags                      = {}
        # (15 unchanged attributes hidden)
    }

  # aws_ecs_task_definition.covidshield_key_retrieval must be replaced
-/+ resource "aws_ecs_task_definition" "covidshield_key_retrieval" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:445131834497:task-definition/KeyRetrieval:27" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 0
                  - environment      = [
                      - {
                          - name  = "ENV"
                          - value = "demo"
                        },
                      - {
                          - name  = "METRICS_USERNAME"
                          - value = "rX8MZ24f1qYiaUXmNVgF"
                        },
                      - {
                          - name  = "METRIC_PROVIDER"
                          - value = "stdout"
                        },
                      - {
                          - name  = "TRACER_PROVIDER"
                          - value = "stdout"
                        },
                    ]
                  - essential        = true
                  - image            = "445131834497.dkr.ecr.ca-central-1.amazonaws.com/covid-server/key-retrieval"
                  - linuxParameters  = {
                      - capabilities = {
                          - drop = [
                              - "ALL",
                            ]
                        }
                    }
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "CovidShield"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "ecs-KeyRetrieval"
                        }
                    }
                  - mountPoints      = []
                  - name             = "key-retrieval"
                  - portMappings     = [
                      - {
                          - containerPort = 8001
                          - hostPort      = 8001
                          - protocol      = "tcp"
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "KEY_CLAIM_TOKEN"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:445131834497:secret:key-submission-env-key-claim-token-ymzi27-ctDs6X"
                        },
                      - {
                          - name      = "RETRIEVE_HMAC_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:445131834497:secret:key-retrieval-env-hmac-key-ymzi27-z6S5xz"
                        },
                      - {
                          - name      = "ECDSA_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:445131834497:secret:key-retrieval-env-ecdsa-key-ymzi27-HB1VtN"
                        },
                      - {
                          - name      = "DATABASE_URL"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:445131834497:secret:server-database-url-ymzi27-AhOoLD"
                        },
                      - {
                          - name      = "METRICS_PASSWORD"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:445131834497:secret:key-metric-password-ymzi27-iaJwHm"
                        },
                    ]
                  - volumesFrom      = []
                },
            ]
        ) -> (known after apply) # forces replacement
      ~ id                       = "KeyRetrieval" -> (known after apply)
      ~ revision                 = 27 -> (known after apply)
        tags                     = {
            "CostCentre" = "CovidShield"
        }
        # (7 unchanged attributes hidden)
    }

  # aws_lb.covidshield_key_retrieval will be updated in-place
  ~ resource "aws_lb" "covidshield_key_retrieval" {
        id                         = "arn:aws:elasticloadbalancing:ca-central-1:445131834497:loadbalancer/app/covidshield-key-retrieval/b1940e8300e9e9a7"
        name                       = "covidshield-key-retrieval"
        tags                       = {
            "CostCentre" = "CovidShield"
            "Name"       = "covidshield-key-retrieval"
        }
        # (14 unchanged attributes hidden)

      ~ access_logs {
          + bucket  = "cbs-satellite-account-bucket445131834497"
          ~ enabled = false -> true
          + prefix  = "445131834497/elb_logs_v2"
        }

        # (3 unchanged blocks hidden)
    }

  # aws_lb.covidshield_key_submission will be updated in-place
  ~ resource "aws_lb" "covidshield_key_submission" {
        id                         = "arn:aws:elasticloadbalancing:ca-central-1:445131834497:loadbalancer/app/covidshield-key-submission/bf583bf6161a0916"
        name                       = "covidshield-key-submission"
        tags                       = {
            "CostCentre" = "CovidShield"
            "Name"       = "covidshield-key-submission"
        }
        # (14 unchanged attributes hidden)

      ~ access_logs {
          + bucket  = "cbs-satellite-account-bucket445131834497"
          ~ enabled = false -> true
          + prefix  = "445131834497/elb_logs_v2"
        }

        # (3 unchanged blocks hidden)
    }

  # aws_s3_bucket.cloudfront_logs will be updated in-place
  ~ resource "aws_s3_bucket" "cloudfront_logs" {
        id                          = "covid-shield-demo-cloudfront-logs"
        tags                        = {}
        # (9 unchanged attributes hidden)



      + logging {
          + target_bucket = "cbs-satellite-account-bucket445131834497"
          + target_prefix = "445131834497/s3_access_logs/covid-shield-demo-cloudfront-logs/"
        }


        # (4 unchanged blocks hidden)
    }

  # aws_s3_bucket.exposure_config will be updated in-place
  ~ resource "aws_s3_bucket" "exposure_config" {
        id                          = "covid-shield-exposure-config-demo"
        tags                        = {}
        # (9 unchanged attributes hidden)

      + logging {
          + target_bucket = "cbs-satellite-account-bucket445131834497"
          + target_prefix = "445131834497/s3_access_logs/covid-shield-exposure-config-demo/"
        }


        # (2 unchanged blocks hidden)
    }

  # aws_s3_bucket.firehose_waf_logs will be updated in-place
  ~ resource "aws_s3_bucket" "firehose_waf_logs" {
        id                          = "covid-shield-demo-waf-logs"
        tags                        = {}
        # (9 unchanged attributes hidden)


      + logging {
          + target_bucket = "cbs-satellite-account-bucket445131834497"
          + target_prefix = "445131834497/s3_access_logs/covid-shield-demo-waf-logs/"
        }


        # (3 unchanged blocks hidden)
    }

  # aws_secretsmanager_secret_version.key_retrieval_env_ecdsa_key must be replaced
-/+ resource "aws_secretsmanager_secret_version" "key_retrieval_env_ecdsa_key" {
      ~ arn            = "arn:aws:secretsmanager:ca-central-1:445131834497:secret:key-retrieval-env-ecdsa-key-ymzi27-HB1VtN" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:ca-central-1:445131834497:secret:key-retrieval-env-ecdsa-key-ymzi27-HB1VtN|24676F69-CBA3-43F2-816C-5758B7AD8C55" -> (known after apply)
      ~ secret_string  = (sensitive value)
      ~ version_id     = "24676F69-CBA3-43F2-816C-5758B7AD8C55" -> (known after apply)
      ~ version_stages = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.in_app_metrics.data.aws_iam_policy_document.write_s3_metrics_csv_buckets will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "write_s3_metrics_csv_buckets"  {
      ~ id      = "2434682084" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:PutObjectAcl",
                          - "s3:PutObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::unmasked-metrics-gtlmt-demo",
                          - "arn:aws:s3:::masked-metrics-gtlmt-demo",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
    }

  # module.in_app_metrics.aws_cloudwatch_event_target.tigger-masked_metrics will be created
  + resource "aws_cloudwatch_event_target" "tigger-masked_metrics" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = "twice-a-day"
      + target_id      = "masked_metrics"
    }

  # module.in_app_metrics.aws_cloudwatch_event_target.tigger-unmasked_metrics will be created
  + resource "aws_cloudwatch_event_target" "tigger-unmasked_metrics" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = "twice-a-day"
      + target_id      = "unmasked_metrics"
    }

  # module.in_app_metrics.aws_cloudwatch_log_group.masked_metrics will be created
  + resource "aws_cloudwatch_log_group" "masked_metrics" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/masked_metrics"
      + retention_in_days = 14
    }

  # module.in_app_metrics.aws_cloudwatch_log_group.unmasked_metrics will be created
  + resource "aws_cloudwatch_log_group" "unmasked_metrics" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/unmasked_metrics"
      + retention_in_days = 14
    }

  # module.in_app_metrics.aws_iam_policy.write_s3_metrics_csv_buckets will be updated in-place
  ~ resource "aws_iam_policy" "write_s3_metrics_csv_buckets" {
        id        = "arn:aws:iam::445131834497:policy/CovidAlertWriteS3CSVBuckets"
        name      = "CovidAlertWriteS3CSVBuckets"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:PutObjectAcl",
                          - "s3:PutObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::unmasked-metrics-gtlmt-demo",
                          - "arn:aws:s3:::masked-metrics-gtlmt-demo",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {}
        # (3 unchanged attributes hidden)
    }

  # module.in_app_metrics.aws_lambda_function.masked_metrics will be created
  + resource "aws_lambda_function" "masked_metrics" {
      + arn                            = (known after apply)
      + function_name                  = "masked_metrics"
      + id                             = (known after apply)
      + image_uri                      = "445131834497.dkr.ecr.ca-central-1.amazonaws.com/covid-server/metrics-server:latest"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::445131834497:role/backoff_lambda_role"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "BUCKET_NAME" = "masked-metrics-gtlmt-demo"
              + "MASK_DATA"   = "true"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }

      + vpc_config {
          + security_group_ids = [
              + "sg-0ea6776ab3b8c34c2",
            ]
          + subnet_ids         = [
              + "subnet-004f7bd4f9af4d6d4",
              + "subnet-08241ad4f1968ece8",
              + "subnet-0e62dcdf9b0516543",
            ]
          + vpc_id             = (known after apply)
        }
    }

  # module.in_app_metrics.aws_lambda_function.unmasked_metrics will be created
  + resource "aws_lambda_function" "unmasked_metrics" {
      + arn                            = (known after apply)
      + function_name                  = "unmasked_metrics"
      + id                             = (known after apply)
      + image_uri                      = "445131834497.dkr.ecr.ca-central-1.amazonaws.com/covid-server/metrics-server:latest"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::445131834497:role/backoff_lambda_role"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "BUCKET_NAME" = "unmasked-metrics-gtlmt-demo"
              + "MASK_DATA"   = "false"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }

      + vpc_config {
          + security_group_ids = [
              + "sg-0ea6776ab3b8c34c2",
            ]
          + subnet_ids         = [
              + "subnet-004f7bd4f9af4d6d4",
              + "subnet-08241ad4f1968ece8",
              + "subnet-0e62dcdf9b0516543",
            ]
          + vpc_id             = (known after apply)
        }
    }

  # module.in_app_metrics.aws_lambda_permission.allow-cloudwatch-to-call-masked_metrics will be created
  + resource "aws_lambda_permission" "allow-cloudwatch-to-call-masked_metrics" {
      + action        = "lambda:InvokeFunction"
      + function_name = "masked_metrics"
      + id            = (known after apply)
      + principal     = "events.amazonaws.com"
      + source_arn    = "arn:aws:events:ca-central-1:445131834497:rule/twice-a-day"
      + statement_id  = "AllowExecutionFromCloudWatch"
    }

  # module.in_app_metrics.aws_lambda_permission.allow-cloudwatch-to-call-unmasked_metrics will be created
  + resource "aws_lambda_permission" "allow-cloudwatch-to-call-unmasked_metrics" {
      + action        = "lambda:InvokeFunction"
      + function_name = "unmasked_metrics"
      + id            = (known after apply)
      + principal     = "events.amazonaws.com"
      + source_arn    = "arn:aws:events:ca-central-1:445131834497:rule/twice-a-day"
      + statement_id  = "AllowExecutionFromCloudWatch"
    }

  # module.in_app_metrics.aws_s3_bucket.masked_metrics will be updated in-place
  ~ resource "aws_s3_bucket" "masked_metrics" {
        id                          = "masked-metrics-gtlmt-demo"
        tags                        = {}
        # (9 unchanged attributes hidden)

      + logging {
          + target_bucket = "cbs-satellite-account-bucket445131834497"
          + target_prefix = "445131834497/s3_access_logs/masked-metrics-gtlmt-demo/"
        }


        # (2 unchanged blocks hidden)
    }

  # module.in_app_metrics.aws_s3_bucket.unmasked_metrics will be updated in-place
  ~ resource "aws_s3_bucket" "unmasked_metrics" {
        id                          = "unmasked-metrics-gtlmt-demo"
        tags                        = {}
        # (9 unchanged attributes hidden)

      + logging {
          + target_bucket = "cbs-satellite-account-bucket445131834497"
          + target_prefix = "445131834497/s3_access_logs/unmasked-metrics-gtlmt_demo/"
        }


        # (2 unchanged blocks hidden)
    }

Plan: 13 to add, 10 to change, 3 to destroy.

Changes to Outputs:
  ~ base_url = "https://v1o7d57660.execute-api.ca-central-1.amazonaws.com/" -> (known after apply)

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

::debug::Terraform exited with code 0.
::debug::stdout: random_string.random: Refreshing state... [id=ymzi27]%0Amodule.in_app_metrics.random_string.bucket_random_id: Refreshing state... [id=gtlmt]%0Aaws_acm_certificate.retrieval_covidshield: Refreshing state... [id=arn:aws:acm:us-east-1:445131834497:certificate/289d5579-f1b4-4060-911c-6e6ab6bc4715]%0Aaws_wafv2_web_acl.key_retrieval_cdn: Refreshing state... [id=290c0829-fa25-4082-8a42-9467b4b29304]%0Aaws_secretsmanager_secret.server_database_url: Refreshing state... [id=arn:aws:secretsmanager:ca-central-1:445131834497:secret:server-database-url-ymzi27-AhOoLD]%0Aaws_secretsmanager_secret.key_retrieval_env_ecdsa_key: Refreshing state... [id=arn:aws:secretsmanager:ca-central-1:445131834497:secret:key-retrieval-env-ecdsa-key-ymzi27-HB1VtN]%0Aaws_ecs_cluster.covidshield: Refreshing state... [id=arn:aws:ecs:ca-central-1:445131834497:cluster/CovidShield]%0Aaws_secretsmanager_secret.key_submission_metrics_password: Refreshing state... [id=arn:aws:secretsmanager:ca-central-1:445131834497:secret:key-metric-password-ymzi27-iaJwHm]%0Aaws_secretsmanager_secret.key_retrieval_env_hmac_key: Refreshing state... [id=arn:aws:secretsmanager:ca-central-1:445131834497:secret:key-retrieval-env-hmac-key-ymzi27-z6S5xz]%0Aaws_secretsmanager_secret.key_submission_env_key_claim_token: Refreshing state... [id=arn:aws:secretsmanager:ca-central-1:445131834497:secret:key-submission-env-key-claim-token-ymzi27-ctDs6X]%0Aaws_wafv2_web_acl.metrics_collection: Refreshing state... [id=388d83ff-347d-4f07-a6e8-dcfaed31f022]%0Aaws_wafv2_ip_set.new_key_claim: Refreshing state... [id=26e4496f-65b1-4a72-b9b0-642e05452cf4]%0Aaws_vpc.covidshield: Refreshing state... [id=vpc-0f08d59ec610efa9f]%0Aaws_route53_health_check.covidshield_key_submission_healthcheck: Refreshing state... [id=3150afd9-a1d6-4787-bbfb-99924327739d]%0Amodule.in_app_metrics.aws_cloudwatch_event_rule.twice-a-day: Refreshing state... [id=twice-a-day]%0Amodule.in_app_metrics.aws_kms_key.metrics_key: Refreshing state... [id=db9f31f6-6724-4098-ba20-f6ac412e46b3]%0Aaws_route53_health_check.covidshield_key_retrieval_healthcheck_ca_json: Refreshing state... [id=cd6f210a-78ce-4ba6-a90f-47e72a8b4753]%0Aaws_api_gateway_api_key.metrics_api_key: Refreshing state... [id=en5arm2qtg]%0Aaws_wafv2_web_acl.key_retrieval: Refreshing state... [id=6f2f44a7-242d-4626-996b-8919690096b6]%0Aaws_acm_certificate.covidshield: Refreshing state... [id=arn:aws:acm:ca-central-1:445131834497:certificate/afa9146e-c959-477b-bbd3-caafa32bba53]%0Aaws_route53_health_check.covidshield_key_retrieval_healthcheck: Refreshing state... [id=40fadd9c-0b75-4b17-b478-cdf083a1dfe7]%0Aaws_cloudwatch_log_group.metrics: Refreshing state... [id=/aws/lambda/save-metrics]%0Aaws_api_gateway_rest_api.metrics: Refreshing state... [id=v1o7d57660]%0Aaws_iam_role.api_gatway_cloudwatch_role: Refreshing state... [id=save-metricsapi_gateway_cloudwatch_role]%0Aaws_ecr_repository.repository["key-submission"]: Refreshing state... [id=covid-server/key-submission]%0Aaws_iam_role.firehose_waf_logs: Refreshing state... [id=firehose_waf_logs]%0Aaws_ecr_repository.repository["monolith"]: Refreshing state... [id=covid-server/monolith]%0Aaws_ecr_repository.repository["key-retrieval"]: Refreshing state... [id=covid-server/key-retrieval]%0Aaws_cloudfront_origin_access_identity.origin_access_identity: Refreshing state... [id=E212DUJ8FH57AC]%0Aaws_iam_role.lambda_validate_deploy: Refreshing state... [id=lambda-validate-deploy]%0Aaws_route53_zone.covidshield: Refreshing state... [id=Z028665636H79UA5DVHCV]%0Amodule.in_app_metrics.aws_dynamodb_table.raw_metrics: Refreshing state... [id=raw_metrics]%0Aaws_route53_health_check.covidshield_key_retrieval_healthcheck_region_json: Refreshing state... [id=bd344266-36ab-4a72-9b40-82855b3bde94]%0Amodule.in_app_metrics.aws_ecr_repository.create_csv: Refreshing state... [id=covid-server/metrics-server]%0Aaws_iam_role.vpc_flow_logs: Refreshing state... [id=vpc_flow_logs]%0Amodule.in_app_metrics.aws_dynamodb_table.aggregate_metrics: Refreshing state... [id=aggregate_metrics]%0Aaws_iam_role.role: Refreshing state... [id=save-metrics.role]%0Aaws_secretsmanager_secret_version.key_submission_env_key_claim_token: Refreshing state... [id=arn:aws:secretsmanager:ca-central-1:445131834497:secret:key-submission-env-key-claim-token-ymzi27-ctDs6X|ADE432F1-1B59-4B86-A53E-50F4ECC8A206]%0Aaws_secretsmanager_secret_version.key_submission_metrics_password: Refreshing state... [id=arn:aws:secretsmanager:ca-central-1:445131834497:secret:key-metric-password-ymzi27-iaJwHm|A7101EDF-0682-4BE6-8CF2-C656723D19CF]%0Aaws_secretsmanager_secret_version.key_retrieval_env_hmac_key: Refreshing state... [id=arn:aws:secretsmanager:ca-central-1:445131834497:secret:key-retrieval-env-hmac-key-ymzi27-z6S5xz|6D05AB97-E512-4326-8313-38440FD6AA82]%0Aaws_secretsmanager_secret_version.key_retrieval_env_ecdsa_key: Refreshing state... [id=arn:aws:secretsmanager:ca-central-1:445131834497:secret:key-retrieval-env-ecdsa-key-ymzi27-HB1VtN|24676F69-CBA3-43F2-816C-5758B7AD8C55]%0Amodule.in_app_metrics.aws_s3_bucket.unmasked_metrics: Refreshing state... [id=unmasked-metrics-gtlmt-demo]%0Amodule.in_app_metrics.aws_s3_bucket.masked_metrics: Refreshing state... [id=masked-metrics-gtlmt-demo]%0Amodule.in_app_metrics.aws_sqs_queue.aggregation_lambda_dead_letter: Refreshing state... [id=https://sqs.ca-central-1.amazonaws.com/445131834497/aggregation-lambda-dead-letter-queue]%0Amodule.in_app_metrics.aws_iam_policy.vpc_networking: Refreshing state... [id=arn:aws:iam::445131834497:policy/CovidAlertVplNetworking]%0Aaws_iam_role.covidshield_key_retrieval: Refreshing state... [id=KeyRetrieval]%0Aaws_s3_bucket.exposure_config: Refreshing state... [id=covid-shield-exposure-config-demo]%0Aaws_api_gateway_account.demo: Refreshing state... [id=api-gateway-account]%0Aaws_iam_role_policy.cloudwatch: Refreshing state... [id=save-metricsapi_gateway_cloudwatch_role:default]%0Amodule.in_app_metrics.aws_iam_role.backoff: Refreshing state... [id=backoff_lambda_role]%0Aaws_iam_role.covidshield_key_submission: Refreshing state... [id=KeySubmission]%0Amodule.in_app_metrics.aws_iam_policy.write_logs: Refreshing state... [id=arn:aws:iam::445131834497:policy/CovidAlertLogWriter]%0Amodule.in_app_metrics.aws_iam_role.metrics_csv: Refreshing state... [id=metrics_csv_lambda_role]%0Amodule.in_app_metrics.aws_iam_role.aggregator: Refreshing state... [id=aggregate_lambda_role]%0Aaws_iam_policy.lambda_logging: Refreshing state... [id=arn:aws:iam::445131834497:policy/save-metrics]%0Aaws_kms_key.cw_us_east: Refreshing state... [id=343f7858-fa06-4db4-b222-6519c0fe4735]%0Aaws_s3_bucket.firehose_waf_logs: Refreshing state... [id=covid-shield-demo-waf-logs]%0Aaws_kms_key.cw: Refreshing state... [id=db78cf66-2642-4829-bc44-2dd721e952f0]%0Aaws_s3_bucket.cloudfront_logs: Refreshing state... [id=covid-shield-demo-cloudfront-logs]%0Aaws_wafv2_web_acl.key_submission: Refreshing state... [id=1dbee81d-3f78-4a42-adf0-beec8a1007b8]%0Aaws_api_gateway_request_validator.metrics_model: Refreshin
```

</details>

*Pusher: @patheard, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*